Repository: grumat/artillery-x4-pro_config
Catalog: unbrick-swx4/locale/*/LC_MESSAGES/messages.po
Languages: de_de, es, fr, it, pt_br

source: Adjust Heat-Break Fan Speed
de_de: Heat-Break-Lüfterdrehzahl
es: Ajustar Velocidad Vent. Heat-Break
fr: Vitesse ventilateur Heat-Break
it: Velocità ventola Heat-break
pt_br: Velocidade Ventoinha Bico

source: Enable Host & MCU Temperature Monitoring
de_de: Host/MCU Temperaturüberwachung
es: Activar Monitoreo Temp. Host/MCU
fr: Surveillance températures Host/MCU
it: Monitoraggio Temp. Host/MCU
pt_br: Monitorar Temp. Host/MCU

source: Nozzle Wipe Settings
de_de: Düsereinigung (Wipe)
es: Ajustes de Limpieza de Boquilla
fr: Réglages nettoyage buse
it: Impostazioni Nozzle Wipe
pt_br: Ajustes de Limpeza (Wipe)

source: Purge Line Settings
de_de: Purge-Line (Startlinie)
es: Ajustes de Línea de Purga
fr: Réglages ligne de purge
it: Impostazioni linea di purga
pt_br: Linha de Purga

source: Enable Filament Change (M600 Support)
de_de: Filamentwechsel (M600)
es: Activar Cambio Filamento (M600)
fr: Activer changement filament (M600)
it: Abilita cambio filamento (M600)
pt_br: Troca de Filamento (M600)

source: Pause Macro Settings
de_de: Pause-Makro-Einstellungen
es: Ajustes de Macro de Pausa
fr: Réglages Macro Pause
it: Impostazioni Macro Pausa
pt_br: Macro de Pausa

source: Save Configuration
es: Guardar Configuración
fr: Enregistrer la Configuration
it: Salva la Configurazione

source: Successfully saved file '{}'
es: Archivo '{}' guardado correctamente
fr: Fichier '{}' sauvegardé avec succès
it: Salvata con successo il file '{}'

source: Connecting to printer using SSH
de_de: Verbindung zum Drucker per SSH
es: Conectando a la impresora vía SSH
fr: Connexion à l'imprimante via SSH
it: Connessione alla stampante via SSH
pt_br: Conectando via SSH

source: SSH connection established.
de_de: SSH-Verbindung hergestellt.
es: Conexión SSH establecida.
fr: Connexion SSH établie.
it: Connessione SSH stabilita.
pt_br: Conexão SSH estabelecida.

source: Check if Artillery Sidewinder X4 Printer Connected
de_de: Prüfe auf Artillery SW X4 Verbindung
es: Verificar si la Artillery Sidewinder X4 está conectada
fr: Vérification de la connexion Artillery SW X4
it: Verifica stampante Artillery SW X4
pt_br: Verificando conexão da SW X4

source: Detected OS is Linux mkspi {0}
de_de: Erkanntes OS: Linux mkspi {0}
es: SO detectado: Linux mkspi {0}
fr: OS détecté : Linux mkspi {0}
it: OS rilevato: Linux mkspi {0}
pt_br: OS detectado: Linux mkspi {0}

source: Failed to retrieve OS version information!
de_de: OS-Versionsinfo konnte nicht geladen werden!
es: ¡Error al obtener información de la versión del SO!
fr: Impossible de récupérer la version de l'OS !
it: Impossibile recuperare versione OS!
pt_br: Falha ao obter versão do OS!

source: MCU STM32F401XC found on {0}
de_de: MCU STM32F401XC gefunden unter {0}
es: MCU STM32F401XC encontrada en {0}
fr: MCU STM32F401XC trouvée sur {0}
it: MCU STM32F401XC trovata su {0}
pt_br: MCU STM32F401XC encontrada em {0}

source: Failed to retrieve MCU Klipper connection!
de_de: MCU Klipper-Verbindung fehlgeschlagen!
es: ¡Error al obtener la conexión de la MCU Klipper!
fr: Impossible de récupérer la connexion MCU Klipper !
it: Impossibile recuperare connessione MCU Klipper!
pt_br: Falha na conexão MCU Klipper!

source: Default printer configuration file '{0}' was found
de_de: Standard-Konfigurationsdatei '{0}' gefunden
es: Archivo de configuración '{0}' encontrado
fr: Fichier de configuration '{0}' trouvé
it: File di configurazione '{0}' trovato
pt_br: Arquivo '{0}' encontrado

source: One of the configuration file is missing!
de_de: Eine Konfigurationsdatei fehlt!
es: ¡Falta uno de los archivos de configuración!
fr: L'un des fichiers de configuration est manquant !
it: Manca uno dei file di configurazione!
pt_br: Faltando arquivo de configuração!

source: The connection does not report an Artillery SW X4 printer
de_de: Verbindung meldet keinen Artillery SW X4 Drucker
es: La conexión no reporta una impresora Artillery SW X4
fr: La connexion ne signale pas une imprimante Artillery SW X4
it: La connessione non indica una stampante Artillery SW X4
pt_br: A conexão não indica uma impressora Artillery SW X4

source: Disconnecting SSH Client
de_de: SSH-Verbindung wird getrennt
es: Desconectando cliente SSH
fr: Déconnexion du client SSH
it: Disconnessione client SSH
pt_br: Desconectando SSH

source: Recovered disk space: {}
de_de: Freigegebener Speicherplatz: {}
es: Espacio recuperado: {}
fr: Espace disque récupéré : {}
it: Spazio recuperato: {}
pt_br: Espaço recuperado: {}

source: Rebooting printer
de_de: Drucker wird neu gestartet
es: Reiniciando impresora
fr: Redémarrage de l'imprimante
it: Riavvio stampante
pt_br: Reiniciando impressora

source: Reading initial disk space
de_de: Lese aktuellen Speicherplatz
es: Leyendo espacio inicial en disco
fr: Lecture de l'espace disque initial
it: Lettura spazio su disco iniziale
pt_br: Lendo espaço inicial

source: Boot partition total size: {0}
de_de: Boot-Partition Gesamtgröße: {0}
es: Tamaño total partición boot: {0}
fr: Taille totale partition Boot : {0}
it: Dimensione totale partizione boot: {0}
pt_br: Tamanho partição boot: {0}

source: Boot partition free size: {0}
de_de: Boot-Partition Freier Speicher: {0}
es: Espacio libre partición boot: {0}
fr: Espace libre partition Boot : {0}
it: Spazio libero partizione boot: {0}
pt_br: Espaço livre boot: {0}

source: Root partition total size: {0}
de_de: Root-Partition Gesamtgröße: {0}
es: Tamaño total partición root: {0}
fr: Taille totale partition Root : {0}
it: Dimensione totale partizione root: {0}
pt_br: Tamanho partição root: {0}

source: Root partition free size: {0}
de_de: Root-Partition Freier Speicher: {0}
es: Espacio libre partición root: {0}
fr: Espace libre partition Root : {0}
it: Spazio libero partizione root: {0}
pt_br: Espaço livre root: {0}

source: Reading final disk space
de_de: Lese abschließenden Speicherplatz
es: Leyendo espacio final en disco
fr: Lecture de l'espace disque final
it: Lettura spazio su disco finale
pt_br: Lendo espaço final

source: Trimming eMMC disk
de_de: Speicheroptimierung (TRIM) läuft
es: Optimizando disco eMMC (Trim)
fr: Exécution du TRIM sur l'eMMC
it: Esecuzione TRIM disco eMMC
pt_br: Executando TRIM no eMMC

source: Flushing file data...
de_de: Schreibe Dateipuffer...
es: Vaciando datos de archivos...
fr: Vidage des données fichiers...
it: Svuotamento dati file...
pt_br: Limpando buffer de arquivos...

source: Trimming eMMC...
de_de: Führe TRIM aus...
es: Ejecutando Trim en eMMC...
fr: Optimisation TRIM eMMC...
it: Esecuzione TRIM...
pt_br: Otimizando eMMC...

source: Searching {}...
de_de: Suche {}...
es: Buscando {}...
fr: Recherche de {}...
it: Ricerca {}...
pt_br: Buscando {}...

source: Deleting {}...
de_de: Lösche {}...
es: Eliminando {}...
fr: Suppression de {}...
it: Eliminazione {}...
pt_br: Apagando {}...

source: Erase .gcode files
de_de: G-Code Dateien löschen
es: Borrar archivos .gcode
fr: Effacer les fichiers .gcode
it: Elimina file .gcode
pt_br: Apagar arquivos .gcode

source: Removed {} .gcode files.
de_de: {} G-Code Dateien entfernt.
es: Se eliminaron {} archivos .gcode.
fr: {} fichiers .gcode supprimés.
it: Rimossi {} file .gcode.
pt_br: Rimovidos {} arquivos .gcode.

source: Erase miniature files
de_de: Vorschaubilder löschen
es: Borrar archivos de miniaturas
fr: Effacer les miniatures
it: Elimina miniature
pt_br: Apagar miniaturas

source: Removed {} miniature files.
de_de: {} Vorschaubilder entfernt.
es: Se eliminaron {} miniaturas.
fr: {} miniatures supprimées.
it: Rimosse {} miniature.
pt_br: Rimovidass {} miniaturas.

source: Erase old configuration files
de_de: Alte Konfigurationen löschen
es: Borrar configuraciones antiguas
fr: Effacer les anciennes configurations
it: Elimina vecchie configurazioni
pt_br: Apagar arquivos config antigos

source: Removed {} old configuration files.
de_de: {} alte Konfigurationen entfernt.
es: Se eliminaron {} archivos de configuración antiguos.
fr: {} anciennes configurations supprimées.
it: Rimossi {} vecchi file config.
pt_br: Rimovidoss {} arquivos config.

source: Erase log files
de_de: Log-Dateien löschen
es: Borrar archivos de registro (logs)
fr: Effacer les fichiers log
it: Elimina file di log
pt_br: Apagar logs

source: Removed {} log files.
de_de: {} Log-Dateien entfernt.
es: Se eliminaron {} archivos de log.
fr: {} fichiers log supprimés.
it: Rimossi {} file di log.
pt_br: Rimovidos {} logs.

source: Erase Artillery clutter files
de_de: Artillery-Datenmüll löschen
es: Borrar archivos basura de Artillery
fr: Effacer les fichiers inutiles Artillery
it: Elimina file spazzatura Artillery
pt_br: Apagar lixo da Artillery

source: Removed {} unneeded files.
de_de: {} unnötige Dateien entfernt.
es: Se eliminaron {} archivos innecesarios.
fr: {} fichiers inutiles supprimés.
it: Rimossi {} file non necessari.
pt_br: Rimovidos {} arquivos desnecessários.

source: Fix file permission
de_de: Zugriffsrechte fixen
es: Corregir permisos de archivos
fr: Réparer les permissions
it: Ripara permessi file
pt_br: Corrigir permissões

source: Applying default permission for {}
de_de: Setze Standardrechte für {}
es: Aplicando permisos por defecto para {}
fr: Application des permissions par défaut pour {}
it: Applicazione permessi predefiniti per {}
pt_br: Aplicando permissões para {}

source: Fix home folder permissions
de_de: Home-Verzeichnis Rechte fixen
es: Corregir permisos de carpeta personal
fr: Réparer les permissions 'home'
it: Ripara permessi cartella home
pt_br: Fixar permissões da home

source: Searching for locked files on user folder...
de_de: Suche nach gesperrten Dateien im User-Ordner...
es: Buscando archivos bloqueados en carpeta de usuario...
fr: Recherche de fichiers verrouillés dans le dossier utilisateur...
it: Ricerca file bloccati nella cartella utente...
pt_br: Buscando arquivos travados...

source: {} files found
de_de: {} Dateien gefunden
es: {} archivos encontrados
fr: {} fichiers trouvés
it: {} file trovati
pt_br: {} arquivos encontrados

source: Fixing file {}...
de_de: Fixe Datei {}...
es: Reparando archivo {}...
fr: Réparation du fichier {}...
it: Riparazione file {}...
pt_br: Corrigindo {}...

source: Stopping User Interface Service
de_de: Stoppe Display-Dienst
es: Deteniendo servicio de Interfaz de Usuario
fr: Arrêt du service d'interface utilisateur
it: Arresto servizio Interfaccia Utente
pt_br: Parando serviço de tela

source: Printer display is now unresponsive.
de_de: Drucker-Display reagiert nun vorübergehend nicht.
es: La pantalla de la impresora no responderá ahora.
fr: L'écran de l'imprimante ne répond plus.
it: Il display non risponderà durante l'operazione.
pt_br: A tela da impressora ficará travada por enquanto.

source: Stopping WebCam Service
de_de: Stoppe WebCam-Dienst
es: Deteniendo servicio de WebCam
fr: Arrêt du service WebCam
it: Arresto servizio WebCam
pt_br: Parando serviço de WebCam

source: Stopping Moonraker Service
de_de: Stoppe Moonraker-Dienst
es: Deteniendo servicio Moonraker
fr: Arrêt du service Moonraker
it: Arresto servizio Moonraker
pt_br: Parando serviço Moonraker

source: Web access is down.
de_de: Web-Zugriff ist offline.
es: El acceso web está desactivado.
fr: Accès Web indisponible.
it: Accesso web disattivato.
pt_br: Interface web offline.

source: Stopping Klipper Service
de_de: Stoppe Klipper-Dienst
es: Deteniendo servicio Klipper
fr: Arrêt du service Klipper
it: Arresto servizio Klipper
pt_br: Parando serviço Klipper

source: Klipper is down.
de_de: Klipper wurde beendet.
es: Klipper está detenido.
fr: Klipper est arrêté.
it: Klipper è arrestato.
pt_br: Klipper parado.

source: Enabling User Interface Service
de_de: Aktiviere Display-Dienst
es: Habilitando servicio de Interfaz
fr: Activation du service d'interface
it: Attivazione servizio Interfaccia
pt_br: Ativando serviço de tela

source: Enabling WebCam Service
de_de: Aktiviere WebCam-Dienst
es: Habilitando servicio de WebCam
fr: Activation du service WebCam
it: Attivazione servizio WebCam
pt_br: Ativando serviço de WebCam

source: Enabling Moonraker Service
de_de: Aktiviere Moonraker-Dienst
es: Habilitando servicio Moonraker
fr: Activation du service Moonraker
it: Attivazione servizio Moonraker
pt_br: Ativando serviço Moonraker

source: Enabling Klipper Service
de_de: Aktiviere Klipper-Dienst
es: Habilitando servicio Klipper
fr: Activation du service Klipper
it: Attivazione servizio Klipper
pt_br: Ativando serviço Klipper

source: Starting Klipper Service
de_de: Starte Klipper-Dienst
es: Iniciando servicio Klipper
fr: Démarrage du service Klipper
it: Avvio servizio Klipper
pt_br: Iniciando Klipper

source: Waiting for Klipper to start...
de_de: Warte auf Klipper-Start...
es: Esperando a que Klipper inicie...
fr: Attente du démarrage de Klipper...
it: In attesa dell'avvio di Klipper...
pt_br: Aguardando Klipper...

source: Starting Moonraker Service
de_de: Starte Moonraker-Dienst
es: Iniciando servicio Moonraker
fr: Démarrage du service Moonraker
it: Avvio servizio Moonraker
pt_br: Iniciando Moonraker

source: Waiting for Moonraker to start...
de_de: Warte auf Moonraker-Start...
es: Esperando a que Moonraker inicie...
fr: Attente du démarrage de Moonraker...
it: In attesa dell'avvio di Moonraker...
pt_br: Aguardando Moonraker...

source: Starting WebCam Service
de_de: Starte WebCam-Dienst
es: Iniciando servicio de WebCam
fr: Démarrage du service WebCam
it: Avvio servizio WebCam
pt_br: Iniciando WebCam

source: Be patient...
de_de: Bitte Geduld...
es: Sea paciente...
fr: Patience...
it: Attendere...
pt_br: Aguarde...

source: Starting User Interface Service
de_de: Starte Display-Dienst
es: Iniciando servicio de Interfaz
fr: Démarrage du service d'interface
it: Avvio servizio Interfaccia
pt_br: Iniciando tela

source: Waiting for User Interface to start...
de_de: Warte auf Display-Start...
es: Esperando a que la Interfaz inicie...
fr: Attente du démarrage de l'interface...
it: In attesa dell'avvio dell'Interfaccia...
pt_br: Aguardando tela...

source: Fix for card resize bug
de_de: Fix für Partitionsfehler
es: Reparar error de redimensionamiento
fr: Réparation bug redimensionnement
it: Fix bug ridimensionamento
pt_br: Correção bug partição

source: Exit
de_de: Beenden
es: Salir
fr: Quitter
it: Esci
pt_br: Sair

source: Run
de_de: Starten
es: Ejecutar
fr: Lancer
it: Esegui
pt_br: Executar

source: Help
de_de: Hilfe
es: Ayuda
fr: Aide
it: Aiuto
pt_br: Ajuda

source: Processing...
de_de: Wird verarbeitet...
es: Procesando...
fr: Traitement...
it: Elaborazione...
pt_br: Processando...

source: Printer IP Address
de_de: IP-Adresse
es: Dirección IP
fr: Adresse IP
it: Indirizzo IP
pt_br: Endereço IP

source: Select Your Printer Model
de_de: Druckermodell wählen
es: Seleccione Modelo
fr: Modèle de l'imprimante
it: Modello stampante
pt_br: Modelo da Impressora

source: Linux Operating System Cleanup
de_de: Linux-Systembereinigung
es: Limpieza del Sistema Linux
fr: Nettoyage du système Linux
it: Pulizia Sistema Linux
pt_br: Limpeza do Sistema Linux

source: Optimize Disk Space
de_de: Platz optimieren
es: Optimizar Espacio
fr: Optimiser l'espace
it: Ottimizza spazio
pt_br: Otimizar Espaço

source: Fix File Permission
de_de: Rechte fixen
es: Reparar Permisos
fr: Réparer les permissions
it: Ripara permessi
pt_br: Corrigir Permissões

source: Fix Disk Resize Bug
de_de: Resize-Bug fixen
es: Reparar Redimensionamiento
fr: Réparer redimensionnement
it: Fix bug disco
pt_br: Bug Partição

source: Klipper Configuration
de_de: Klipper-Konfiguration
es: Configuración de Klipper
fr: Configuration Klipper
it: Configurazione Klipper
pt_br: Configuração Klipper

source: Configuration Reset
de_de: Reset-Optionen
es: Restablecer Configuración
fr: Reset Configuration
it: Reset configurazione
pt_br: Redefinir

source: Update only (default)
de_de: Nur Update (Standard)
es: Solo actualizar (predeterminado)
fr: Mise à jour seule (défaut)
it: Solo aggiornamento (default)
pt_br: Apenas atualizar (padrão)

source: Reset calibration
de_de: Kalibrierung zurücksetzen
es: Restablecer calibración
fr: Réinitialiser calibrage
it: Reset calibrazione
pt_br: Resetar calibração

source: Factory Reset (keep calibration)
de_de: Werksreset (mit Kalibrierung)
es: Reset de Fábrica (mantener calibración)
fr: Reset usine (garder calibrage)
it: Reset fabbrica (mantieni calib.)
pt_br: Reset de fábrica (mantém calib.)

source: Complete Factory Reset
de_de: Vollständiger Werksreset
es: Reset de Fábrica Completo
fr: Reset usine complet
it: Reset fabbrica completo
pt_br: Reset de fábrica completo

source: Extruder
es: Extrusor
fr: Extrudeur
it: Estrusore
pt_br: Extrusora

source: Do not change
de_de: Nicht ändern
es: No cambiar
fr: Ne pas modifier
it: Non modificare
pt_br: Não alterar

source: 900mA (recommendation)
de_de: 900mA (Empfehlung)
es: 900mA (recomendado)
fr: 900mA (recommandé)
it: 900mA (consigliato)
pt_br: 900mA (recomendado)

source: Z-Probe
es: Sonda Z
fr: Sonde Z
it: Sonda Z

source: Input Pin Polarity
es: Polaridad del pin de entrada
fr: Polarité de la broche d'entrée
it: Polarità del pin di ingresso

source: NC (default)
es: NC (valor de fábrica)
fr: NF (paramètre d’usine)
it: NC (valori di fabbrica)

source: Factory Mount (default)
de_de: Werksmontage (Standard)
es: Montaje de Fábrica (predet.)
fr: Montage usine (défaut)
it: Montaggio fabbrica (default)
pt_br: Montagem Fábrica (padrão)

source: 180° Mount
de_de: 180° gedreht montiert
es: Montaje 180°
fr: Montage à 180°
it: Montaggio 180°
pt_br: Montagem 180°

source: Factory default
de_de: Werkseinstellung
es: Valor de fábrica
fr: Valeur d'usine
it: Default fabbrica
pt_br: Padrão de fábrica

source: Improved
de_de: Verbessert
es: Mejorado
fr: Amélioré
it: Migliorato
pt_br: Melhorado

source: Higher precision
de_de: Höhere Präzision
es: Mayor precisión
fr: Haute précision
it: Alta precisione
pt_br: Alta precisão

source: Gantry
de_de: Achsen/Gantry
es: Pórtico
fr: Portique
it: Gantry (Ponte)
pt_br: Gantry (Pórtico)

source: Print Bed
de_de: Druckbett
es: Cama de Impresión
fr: Plateau d'impression
it: Piatto di stampa
pt_br: Mesa de Impressão

source: Printer Fans
de_de: Drucker-Lüfter
es: Ventiladores
fr: Ventilateurs
it: Ventole stampante
pt_br: Ventoinhas

source: Max (default)
de_de: Max (Standard)
es: Máximo (predet.)
fr: Max (défaut)
pt_br: Máx (padrão)

source: Temperatures
de_de: Temperaturen
es: Temperaturas
fr: Températures
it: Temperature
pt_br: Temperaturas

source: Do not Change
de_de: Nicht ändern
es: No cambiar
fr: Ne pas modifier
it: Non modificare
pt_br: Não Alterar

source: Legacy Version
es: Versión Legacy
fr: Version Legacy
it: Versione Legacy
pt_br: Versão Legada

source: New Version
de_de: Neue Version
es: Versión Nueva
fr: Version Nouvelle
it: Nuova Versione
pt_br: Nova Versão

source: Grumat Version
es: Versión Grumat
fr: Version Grumat
it: Versione Grumat
pt_br: Versão Grumat

source: Artillery Version
es: Versión Artillery
fr: Version Artillery
it: Versione Artillery
pt_br: Versão Artillery

source: Artillery SideWinder X4 Unbrick Tool v1.0
es: Herramienta Unbrick Artillery SideWinder X4 v1.0
fr: Outil Unbrick Artillery SideWinder X4 v1.0
it: Strumento Unbrick Artillery SideWinder X4 v1.0

source: NO (Panasonic GX-H12A)
es: NA (Panasonic GX-H12A)
it: NA (Panasonic GX-H12A)

source: Z-Axis Distance Sensor
de_de: Z-Abstandssensor
pt_br: Sensor de Distância Z

source: Artillery SideWinder X4 Unbrick Tool v0.2
pt_br: Ferramenta de Unbrick Artillery SW X4 v0.2
