Repository: grumat/artillery-x4-pro_config
Catalog: unbrick-swx4/locale/*/LC_MESSAGES/messages.po
Languages: de_de, es, fr, it, pt_br

source: Printer IP Address What to do: Enter the IP address displayed in your printer's network setup menu. This tool uses SSH to connect to your printer, using Artillery's default password. Important Note: If you've changed the SSH password from the factory default, this tool won't be able to connect. You'll need to reset the password.
de_de: IP-Adresse des Druckers Anleitung: Geben Sie die IP-Adresse ein, die im Netzwerk-Setup-Menü Ihres Druckers angezeigt wird. Dieses Tool verbindet sich per SSH mit dem Standardpasswort von Artillery. Wichtiger Hinweis: Falls Sie das SSH-Passwort geändert haben, kann sich dieses Tool nicht verbinden. Sie müssen das Passwort in diesem Fall zurücksetzen.
es: Dirección IP de la Impresora Qué hacer: Introduzca la dirección IP que se muestra en el menú de configuración de red de su impresora. Esta herramienta utiliza SSH para conectarse a su impresora, utilizando la contraseña predeterminada de Artillery. Nota importante: Si ha cambiado la contraseña SSH de fábrica, esta herramienta no podrá conectarse. Deberá restablecer la contraseña.
fr: Adresse IP de l'imprimante Que faire : Saisissez l'adresse IP affichée dans le menu de configuration réseau de votre imprimante. Cet outil utilise SSH pour se connecter à votre imprimante, en utilisant le mot de passe par défaut d'Artillery. Note importante : Si vous avez modifié le mot de passe SSH par défaut, cet outil ne pourra pas se connecter. Vous devrez réinitialiser le mot de passe.
it: Indirizzo IP della stampante Cosa fare: Inserisci l'indirizzo IP visualizzato nel menu di configurazione di rete della stampante. Questo strumento usa SSH per connettersi, utilizzando la password predefinita di Artillery. Nota importante: se hai cambiato la password SSH rispetto a quella di fabbrica, lo strumento non potrà connettersi. Sarà necessario ripristinarla.
pt_br: Endereço IP da Impressora O que fazer: Insira o endereço IP exibido no menu de configuração de rede da sua impressora. Esta ferramenta usa SSH para se conectar, utilizando a senha padrão da Artillery. Nota Importante: Se você alterou a senha SSH padrão de fábrica, esta ferramenta não conseguirá se conectar. Você precisará redefinir a senha.

source: Select Your Printer Model Why this matters: The Sidewinder X4 Pro and X4 Plus have different hardware. Choosing the wrong model can cause serious printing issues. What to do: - Double-check your printer model before selecting. - If you make a mistake, simply run this tool again with the correct model. Warning: Using the wrong setting may lead to failed prints or other problems. Always verify your selection!
de_de: Druckermodell auswählen Warum das wichtig ist: Sidewinder X4 Pro und X4 Plus nutzen unterschiedliche Hardware. Die Wahl des falschen Modells kann zu schwerwiegenden Druckproblemen führen. Vorgehensweise: - Überprüfen Sie Ihr Modell genau, bevor Sie fortfahren. - Falls Sie sich geirrt haben, führen Sie das Tool einfach erneut mit dem korrekten Modell aus. Warnung: Falsche Einstellungen können zu Fehldrucken führen. Bitte Auswahl prüfen!
es: Seleccione su Modelo de Impresora Por qué es importante: La Sidewinder X4 Pro y la X4 Plus tienen hardware diferente. Elegir el modelo incorrecto puede causar problemas graves de impresión. Qué hacer: - Verifique bien su modelo de impresora antes de seleccionar. - Si comete un error, simplemente ejecute esta herramienta de nuevo con el modelo correcto. Advertencia: El uso de una configuración incorrecta puede provocar fallos de impresión u otros problemas. ¡Verifique siempre su selección!
fr: Sélectionnez votre modèle d'imprimante Pourquoi est-ce important : La Sidewinder X4 Pro et la X4 Plus ont un matériel différent. Choisir le mauvais modèle peut causer de graves problèmes d'impression. Que faire : - Vérifiez bien votre modèle d'imprimante avant de sélectionner. - Si vous faites une erreur, relancez simplement cet outil avec le bon modèle. Attention : L'utilisation d'un mauvais réglage peut entraîner des échecs d'impression ou d'autres problèmes. Vérifiez toujours votre sélection !
it: Seleziona il tuo modello di stampante Perché è importante: La Sidewinder X4 Pro e la X4 Plus hanno hardware differente. Scegliere il modello sbagliato può causare seri problemi di stampa. Cosa fare: - Controlla bene il modello prima di selezionare. - Se commetti un errore, avvia nuovamente lo strumento con il modello corretto. Attenzione: impostazioni errate possono portare a fallimenti di stampa o altri danni. Verifica sempre la tua scelta!
pt_br: Selecione o Modelo da Sua Impressora Por que isso é importante: A Sidewinder X4 Pro e a X4 Plus possuem hardware diferente. Escolher o modelo errado pode causar sérios problemas de impressão. O que fazer: - Verifique o modelo da sua impressora antes de selecionar. - Se cometer um erro, basta executar a ferramenta novamente com o modelo correto. Aviso: O uso de configurações incorretas pode levar a falhas de impressão ou outros problemas. Sempre verifique sua seleção!

source: Reset Printer Configuration What it does: This option lets you restore your printer's configuration file to factory defaults. When to use it: - Usually, you don't need this. The tool only adjusts specific settings, so a full reset is rarely required. - Enable it only if the tool fails to fix your Klipper configuration issues. Your choices: - Reset settings only: Keeps your calibration data intact. - Reset settings and calibration: Use this if your printer is behaving unpredictably. Recommendation: Start with the default (no reset). Only use this option as a last resort.
de_de: Druckerkonfiguration zurücksetzen Funktion: Hiermit stellen Sie die Konfigurationsdatei auf Werkszustand zurück. Anwendung: - Normalerweise nicht nötig, da das Tool nur gezielte Änderungen vornimmt. - Nur aktivieren, wenn Klipper-Probleme anderweitig nicht gelöst werden können. Optionen: - Nur Einstellungen zurücksetzen: Kalibrierungsdaten bleiben erhalten. - Alles zurücksetzen: Falls der Drucker unvorhersehbares Verhalten zeigt. Empfehlung: Zuerst ohne Reset versuchen. Reset nur als letzte Lösung nutzen.
es: Restablecer Configuración de la Impresora Qué hace: Esta opción le permite restaurar el archivo de configuración de su impresora a los valores de fábrica. Cuándo usarla: - Normalmente no lo necesita. La herramienta solo ajusta configuraciones específicas, por lo que rara vez se requiere un restablecimiento completo. - Actívela solo si la herramienta no logra solucionar sus problemas de configuración de Klipper. Sus opciones: - Restablecer solo ajustes: Mantiene intactos sus datos de calibración. - Restablecer ajustes y calibración: Use esto si su impresora se comporta de forma impredecible. Recomendación: Comience con el valor predeterminado (sin restablecer). Use esta opción solo como último recurso.
fr: Réinitialiser la configuration de l'imprimante Ce que cela fait : Cette option vous permet de restaurer le fichier de configuration de votre imprimante aux paramètres d'usine. Quand l'utiliser : - Habituellement, vous n'en avez pas besoin. L'outil n'ajuste que des réglages spécifiques, une réinitialisation complète est donc rare. - Activez-la uniquement si l'outil ne parvient pas à corriger vos problèmes de configuration Klipper. Vos choix : - Réinitialiser les réglages uniquement : Conserve vos données de calibrage. - Réinitialiser réglages et calibrage : À utiliser si l'imprimante a un comportement imprévisible. Recommandation : Commencez par le défaut (pas de reset). N'utilisez cette option qu'en dernier recours.
it: Ripristino configurazione stampante Cosa fa: questa opzione ripristina il file di configurazione ai valori di fabbrica. Quando usarlo: - Solitamente non è necessario. Lo strumento modifica solo parametri specifici, quindi un reset totale è raro. - Attivalo solo se lo strumento non riesce a risolvere i problemi di Klipper. Le tue scelte: - Ripristina solo impostazioni: mantiene i dati di calibrazione. - Ripristina tutto: usalo se la stampante si comporta in modo anomalo. Consiglio: inizia senza reset. Usa questa opzione solo come ultima risorsa.
pt_br: Redefinir Configuração da Impressora O que faz: Esta opção permite restaurar o arquivo de configuração para os padrões de fábrica. Quando usar: - Geralmente, você não precisa disso. A ferramenta ajusta apenas configurações específicas, então um reset completo é raro. - Ative apenas se a ferramenta não conseguir corrigir os problemas do Klipper. Suas escolhas: - Redefinir apenas configurações: Mantém seus dados de calibração intactos. - Redefinir tudo: Use se a impressora estiver se comportando de forma imprevisível. Recomendação: Comece pelo padrão (sem reset). Use esta opção apenas em último caso.

source: Optimize Disk Space What it does: This tool cleans up unnecessary files, such as: - Old print files and thumbnails - Leftover developer files that Artillery forgot to remove Why use it? Your printer's 8GB eMMC disk has limited space. If the system runs out of space, your printer may fail to boot or function properly. Recommendation: Enable this option regularly to free up space and keep your printer running smoothly.
de_de: Speicherplatz optimieren Funktion: Bereinigt unnötige Dateien, wie: - Alte Druckdateien und Vorschaubilder (Thumbnails) - Überflüssige Entwicklerdateien aus der Werksinstallation Grund: Der 8GB eMMC-Speicher ist begrenzt. Bei vollem Speicher startet der Drucker evtl. nicht mehr korrekt. Empfehlung: Regelmäßig nutzen, um die Systemstabilität zu gewährleisten.
es: Optimizar Espacio en Disco Qué hace: Esta herramienta limpia archivos innecesarios, tales como: - Archivos de impresión antiguos y miniaturas - Archivos residuales de desarrollo que Artillery olvidó eliminar ¿Por qué usarlo? El disco eMMC de 8GB de su impresora tiene espacio limitado. Si el sistema se queda sin espacio, su impresora podría no arrancar o no funcionar correctamente. Recomendación: Active esta opción regularmente para liberar espacio y mantener su impresora funcionando sin problemas.
fr: Optimiser l'espace disque Ce que cela fait : Cet outil nettoie les fichiers inutiles, tels que : - Les anciens fichiers d'impression et miniatures - Les fichiers de développement qu'Artillery a oublié de supprimer Pourquoi l'utiliser ? Le disque eMMC de 8 Go a un espace limité. Si le système manque de place, l'imprimante peut ne plus démarrer ou mal fonctionner. Recommandation : Activez cette option régulièrement pour libérer de l'espace.
it: Ottimizza spazio su disco Cosa fa: pulisce i file non necessari, come: - Vecchi file di stampa e miniature - File residui di sviluppo che Artillery non ha rimosso Perché usarlo? Il disco eMMC da 8GB ha spazio limitato. Se lo spazio esaurisce, la stampante potrebbe non avviarsi o bloccarsi. Consiglio: attiva questa opzione regolarmente per liberare spazio.
pt_br: Otimizar Espaço em Disco O que faz: Limpa arquivos desnecessários, como: - Arquivos de impressão antigos e miniaturas (thumbnails) - Arquivos de desenvolvimento que a Artillery esqueceu de remover Por que usar? O disco eMMC de 8GB tem espaço limitado. Se o sistema ficar sem espaço, a impressora pode não iniciar ou funcionar corretamente. Recomendação: Ative esta opção regularmente para manter o sistema estável.

source: Fix File Permissions What it does: Some files on your printer's factory installation may have incorrect permissions. While most of these issues are harmless, they can occasionally cause problems. Why use this tool? This tool checks and corrects file permissions to ensure: - The Klipper environment can access all necessary files. - Your printer runs smoothly without permission-related errors. When to use it: Run this tool if you notice unexpected errors or after a fresh installation. It's safe and won't make unnecessary changes.
de_de: Dateiberechtigungen reparieren Funktion: Korrigiert fehlerhafte Zugriffsrechte der Werksinstallation. Dies verhindert sporadische Fehler im Klipper-System. Vorteil: Stellt sicher, dass Klipper auf alle nötigen Dateien zugreifen kann. Zeitpunkt: Bei unerwarteten Fehlern oder nach einer Neuinstallation ausführen.
es: Reparar Permisos de Archivos Qué hace: Algunos archivos de la instalación de fábrica de su impresora pueden tener permisos incorrectos. Aunque la mayoría son inofensivos, ocasionalmente pueden causar problemas. ¿Por qué usar esta herramienta? Comprueba y corrige los permisos para garantizar: - Que el entorno Klipper pueda acceder a todos los archivos necesarios. - Que su impresora funcione correctamente sin errores de permisos. Cuándo usarla: Ejecute esta herramienta si nota errores inesperados o después de una instalación nueva. Es seguro y no realizará cambios innecesarios.
fr: Réparer les permissions de fichiers Ce que cela fait : Certains fichiers d'usine peuvent avoir des permissions incorrectes. Bien que souvent inoffensif, cela peut parfois causer des problèmes. Pourquoi utiliser cet outil ? Il vérifie et corrige les droits pour s'assurer que : - L'environnement Klipper accède à tous les fichiers nécessaires. - L'imprimante fonctionne sans erreurs liées aux permissions. Quand l'utiliser : Si vous voyez des erreurs inattendues ou après une nouvelle installation. C'est sûr et sans changements inutiles.
it: Ripara permessi dei file Cosa fa: corregge i permessi dei file che potrebbero essere errati nella configurazione di fabbrica. Anche se spesso innocui, i permessi errati possono causare bug casuali. Vantaggi: - Assicura che Klipper acceda a tutti i file necessari. - Evita errori di sistema legati ai permessi. Quando usarlo: se riscontri errori imprevisti o dopo un'installazione pulita.
pt_br: Corrigir Permissões de Arquivos O que faz: Corrige permissões de arquivos que podem vir incorretas de fábrica. Isso evita erros esporádicos no ambiente Klipper. Vantagem: Garante que o sistema tenha acesso a todos os arquivos necessários para rodar sem travamentos relacionados a permissões.

source: Fix Disk Resize Bug What it does: The Artillery Sidewinder X4 Plus sometimes shows a warning in the system log about disk partition resizing. This is a known issue, but it's mostly harmless — it only affects performance slightly. Why use this tool? This tool checks if the problem exists on your printer and applies a fix if needed. It's safe to run and won't make changes unless the issue is detected. When to use it: Enable this tool if you see disk resize warnings in your logs or want to ensure optimal performance.
de_de: Disk-Resize-Bug beheben Funktion: Behebt eine Warnung beim X4 Plus bezüglich der Partitionsgröße. Obwohl meist harmlos, kann dies die Performance leicht beeinträchtigen. Das Tool prüft den Status und wendet den Fix nur bei Bedarf an.
es: Reparar Error de Redimensionamiento de Disco Qué hace: La Artillery Sidewinder X4 Plus a veces muestra una advertencia en el registro del sistema sobre el redimensionamiento de las particiones del disco. Es un problema conocido pero mayormente inofensivo; solo afecta ligeramente al rendimiento. ¿Por qué usar esta herramienta? Comprueba si el problema existe en su impresora y aplica una solución si es necesario. Es seguro y no realizará cambios a menos que detecte el problema. Cuándo usarla: Active esta herramienta si ve advertencias de redimensionamiento en sus registros o si desea asegurar un rendimiento óptimo.
fr: Réparer le bug de redimensionnement de disque Ce que cela fait : La X4 Plus affiche parfois une alerte sur le redimensionnement des partitions. C'est un problème connu, surtout esthétique, mais qui peut affecter légèrement les performances. Pourquoi l'utiliser ? L'outil vérifie si le problème est présent et l'applique si nécessaire. Aucun changement n'est fait si le bug n'est pas détecté. Quand l'utiliser : Si vous voyez des alertes de partition dans les logs.
it: Ripara bug ridimensionamento disco Cosa fa: la X4 Plus mostra a volte un avviso nei log riguardo al ridimensionamento delle partizioni. È un problema noto ma per lo più innocuo; tuttavia, può influire leggermente sulle prestazioni. Cosa fa lo strumento: controlla se il problema è presente e applica una correzione. Non effettua modifiche se non necessario.
pt_br: Corrigir Bug de Redimensionamento de Disco O que faz: A X4 Plus às vezes exibe avisos sobre o redimensionamento da partição. Esta ferramenta verifica se o problema existe e aplica a correção se necessário.

source: Trim eMMC Storage What it does: Your printer uses an 8GB (or optional 32GB) eMMC to store the operating system, Klipper, and your print files. Over time, deleted files leave behind "garbage" data, which can slow down the system. Why use this tool? - eMMC memory doesn't automatically clean up deleted files right away. - Running TRIM removes this leftover data, keeping your printer's storage fast and reliable. When to use it: Run this tool occasionally to maintain performance, especially if your printer feels sluggish.
de_de: Die eMMC Speicher Optimieren Was es bewirkt: Dein Drucker verwendet ein 8GB (oder optional 32GB) eMMC, um das Betriebssystem, Klipper und deine Druckdateien zu speichern. Mit der Zeit hinterlassen gelöschte Dateien "Müll"-Daten, die das System verlangsamen können. Warum dieses Werkzeug verwenden? - eMMC-Speicher beseitigt gelöschte Dateien nicht automatisch sofort. - Das Ausführen von TRIM entfernt diese übrig gebliebenen Daten, sodass der Speicher Ihres Druckers schnell und zuverlässig bleibt. Wann sollte man es verwenden: Nutze dieses Tool gelegentlich, um die Leistung zu erhalten, besonders wenn dein Drucker träge wirkt.
es: Optimizar Almacenamiento eMMC (TRIM) Qué hace: Su impresora usa una eMMC de 8GB (o 32GB opcional) para el sistema operativo, Klipper y sus archivos. Con el tiempo, los archivos borrados dejan datos residuales que pueden ralentizar el sistema. ¿Por qué usar esta herramienta? - La memoria eMMC no limpia automáticamente los archivos borrados de inmediato. - Ejecutar TRIM elimina estos restos, manteniendo el almacenamiento rápido y confiable. Cuándo usarla: Ejecute esta herramienta ocasionalmente para mantener el rendimiento, especialmente si nota la impresora lenta.
fr: Optimisation TRIM du stockage eMMC Ce que cela fait : Votre imprimante utilise une eMMC de 8 Go (ou 32 Go). Avec le temps, les fichiers supprimés laissent des résidus qui peuvent ralentir le système. Pourquoi l'utiliser ? - La mémoire eMMC ne nettoie pas immédiatement les fichiers supprimés. - Le TRIM supprime ces résidus, gardant le stockage rapide. Quand l'utiliser : Occasionnellement pour maintenir les performances.
it: Ottimizzazione TRIM (eMMC) Cosa fa: la stampante usa una memoria eMMC. Col tempo, i file eliminati lasciano residui che possono rallentare il sistema. Perché usarlo? - La memoria eMMC non si pulisce da sola istantaneamente. - Il comando TRIM rimuove i dati inutilizzati, mantenendo il sistema veloce. Quando usarlo: occasionalmente per mantenere le prestazioni ottimali.
pt_br: Otimização TRIM (eMMC) O que faz: Remove resíduos de arquivos deletados da memória eMMC. Como memórias flash não limpam arquivos deletados instantaneamente, o TRIM mantém o sistema rápido e evita lentidão ao longo do tempo.

source: Fix Printer Model Settings What it does: This tool checks your printer's current settings and automatically corrects any mismatches with the selected printer model (e.g., Sidewinder X4 Pro or X4 Plus). Why use it? It ensures that critical Klipper settings are properly configured for your specific printer model. This may include: - Stepper motor settings - Printer homing behavior - Bed mesh configuration - Custom macros When to use it: Run this tool if you've changed your printer model in the control panel or if you suspect settings are incorrect.
de_de: Modell-Einstellungen korrigieren Funktion: Gleicht Klipper-Parameter mit dem gewählten Modell (Pro/Plus) ab. Korrigiert Motorströme, Homing-Verhalten und Bed-Mesh-Einstellungen.
es: Corregir Ajustes del Modelo de Impresora Qué hace: Comprueba los ajustes actuales y corrige automáticamente cualquier desajuste con el modelo seleccionado (X4 Pro o X4 Plus). ¿Por qué usarlo? Asegura que los ajustes críticos de Klipper estén configurados para su modelo específico. Esto incluye: - Ajustes de los motores paso a paso - Comportamiento de homing - Configuración de la malla de la cama (bed mesh) - Macros personalizadas Cuándo usarlo: Si ha cambiado de modelo en el panel de control o si sospecha que los ajustes no son correctos.
fr: Réparer les paramètres du modèle Ce que cela fait : Vérifie et corrige les réglages pour qu'ils correspondent au modèle choisi (X4 Pro ou X4 Plus). Pourquoi l'utiliser ? Assure que les paramètres Klipper critiques sont corrects : - Courant des moteurs pas à pas - Comportement du 'Homing' - Configuration du 'Bed Mesh' (maillage du plateau) - Macros personnalisées Quand l'utiliser : exécutez cet outil si vous avez modifié le modèle de votre imprimante dans le panneau de configuration ou si vous pensez que les paramètres sont incorrects.
it: Correggi impostazioni modello Cosa fa: allinea la configurazione di Klipper al modello selezionato (X4 Pro o X4 Plus), correggendo parametri come il corrente dei motori, il comportamento di homing e le macro personalizzate.
pt_br: Corrigir Configurações do Modelo O que faz: Alinha as configurações do Klipper com o modelo selecionado (Pro/Plus). Corrige correntes de motores, comportamento de homing e malha da mesa (bed mesh).

source: Enable Exclude Object What it does: Turns on Klipper's "Exclude Object" feature, allowing you to cancel individual objects during a multi-object print. How it works: - Pause your print, select the object(s) to exclude, and resume — Klipper will skip them. Important: This feature only works if your slicer is configured to support it. Check your slicer's settings for "Exclude Object" or "Cancel Objects" options.
de_de: „Exclude Object“ aktivieren Funktion: Erlaubt das Abbrechen einzelner Objekte während eines Drucks mit mehreren Teilen, ohne den gesamten Druck zu stoppen. Hinweis: Muss auch im Slicer aktiviert sein.
es: Activar Excluir Objeto Qué hace: Activa la función "Exclude Object" de Klipper, que permite cancelar objetos individuales durante una impresión múltiple. Cómo funciona: - Pause la impresión, seleccione los objetos a excluir y reanude; Klipper los omitirá. Importante: Solo funciona si su laminador (slicer) está configurado para soportarlo. Busque opciones como "Exclude Object" o "Cancel Objects" en su laminador.
fr: Activer 'Exclude Object' Ce que cela fait : Active la fonction "Exclude Object" de Klipper, vous permettant d'annuler des objets individuels lors d'une impression multi-objets. Comment ça marche : - Mettez votre impression en pause, sélectionnez le ou les objets à exclure, et reprenez — Klipper les ignorera. Important : Cette fonction ne marche que si votre slicer est configuré pour la prendre en charge. Vérifiez les options "Exclude Object" ou "Cancel Objects" dans les paramètres de votre slicer.
it: Abilita 'Exclude Object' Cosa fa: attiva la funzione "Exclude Object" di Klipper, che consente di annullare singoli oggetti durante una stampa multipla. Come funziona: - Metti in pausa la stampa, seleziona gli oggetti da escludere e riprendi: Klipper li salterà. Importante: questa funzione funziona solo se lo slicer è configurato per supportarla. Controlla le impostazioni dello slicer per le opzioni "Exclude Object" o "Cancel Objects".
pt_br: Ativar 'Exclude Object' O que faz: Permite cancelar um objeto específico durante uma impressão de múltiplas peças sem interromper as outras. Nota: O seu fatiador (slicer) deve estar configurado para suportar esta função.
