Repository: grumat/artillery-x4-pro_config
Catalog: unbrick-swx4/locale/*/LC_MESSAGES/messages.po
Languages: de_de, es, fr, it, pt_br

source: Adjust Mainboard Fan Speed What it does: Lets you reduce the speed of the mainboard fan to lower noise levels. Important Note: The mainboard fan's primary job is to cool the stepper motor drivers, which can heat up during fast or intense movements. If cooling is insufficient, a driver may overheat, triggering thermal protection and stopping the affected axis. Recommendation: - If you want to reduce fan noise, consider installing a fan duct (available in my repository). This focuses airflow directly on the stepper drivers, allowing you to safely lower the fan speed. - Only reduce fan speed if you've not speeding your printer to the limits.
de_de: Mainboard-Lüftergeschwindigkeit anpassen Erlaubt die Reduzierung der Drehzahl zur Geräuschminderung. Achtung: Zu geringe Kühlung kann zum Abschalten der Motortreiber führen.
es: Ajustar Velocidad del Ventilador de Placa Qué hace: Permite reducir la velocidad del ventilador de la placa base para bajar el nivel de ruido. Nota importante: Su función principal es enfriar los drivers de los motores, que se calientan con movimientos rápidos o intensos. Si el enfriamiento es insuficiente, un driver puede sobrecalentarse y detener el eje. Recomendación: - Si desea reducir el ruido, considere instalar un conducto (fan duct) de mi repositorio para dirigir el aire a los drivers. - Solo reduzca la velocidad si no está llevando su impresora al límite de velocidad.
fr: Ajuster la vitesse du ventilateur de la carte mère Ce que cela fait : Vous permet de réduire la vitesse du ventilateur de la carte mère pour diminuer le niveau sonore. Note importante : Le rôle principal de ce ventilateur est de refroidir les pilotes (drivers) des moteurs pas à pas. Si le refroidissement est insuffisant, un pilote peut surchauffer, déclenchant une protection thermique qui arrêtera l'axe concerné. Recommandation : - Pour réduire le bruit, envisagez d'installer un conduit de ventilateur (disponible sur mon dépôt). Cela concentre le flux d'air sur les pilotes, permettant de baisser la vitesse en toute sécurité. - Ne réduisez la vitesse que si vous ne poussez pas votre imprimante dans ses limites.
it: Regola velocità ventola scheda madre Permette di ridurre il rumore, ma attenzione: una velocità troppo bassa può far bloccare i driver per eccessivo calore.
pt_br: Ajustar Velocidade da Ventoinha da Placa Permite reduzir o ruído, mas tenha cuidado: velocidade muito baixa pode fazer os drivers desligarem por segurança térmica.

source: Adjust Heat-Break Fan Speed What it does: Lets you reduce the speed of the heat-break fan to lower noise levels. Key Considerations: - The heat-break fan prevents filament from softening near the hot-end entry, which can cause clogs if cooling is insufficient. - The default speed is designed for high-temperature printing (above 250°C). Recommendation: - If you rarely print above 250°C, you can safely reduce the fan speed (e.g., to 90%), which noticeably lowers noise without risking clogs. - Monitor your prints after adjusting — if clogs occur, increase the fan speed. Note: Artillery's newer print heads use a smaller heat sink, suggesting the original design may be overbuilt. This further supports reducing fan speed for most users.
de_de: Heat-Break-Lüftergeschwindigkeit anpassen Reduziert das hochfrequente Geräusch am Druckkopf. 90 % sind meist sicher, solange nicht dauerhaft über 250 °C gedruckt wird.
es: Ajustar Ventilador del Heat-Break Qué hace: Permite reducir la velocidad del ventilador del heat-break para bajar el ruido. Consideraciones clave: - Este ventilador evita que el filamento se ablande antes de tiempo, lo que causaría atascos. - La velocidad por defecto es para altas temperaturas (más de 250°C). Recomendación: - Si rara vez imprime a más de 250°C, puede bajarlo (ej. al 90%) para reducir el ruido sin riesgo. - Vigile sus impresiones; si hay atascos, suba la velocidad. Nota: Los cabezales nuevos de Artillery tienen disipadores más pequeños, lo que sugiere que el diseño original estaba sobredimensionado.
fr: Ajuster la vitesse du ventilateur 'Heat-break' Permet de réduire le sifflement de la tête. 90% est souvent suffisant si vous n'imprimez pas au-dessus de 250°C.
it: Regola velocità ventola Heat-break Riduce il rumore della testa di stampa. Il 90% è solitamente sicuro se non si stampa oltre i 250°C.
pt_br: Ajustar Velocidade da Ventoinha do Heat-Break Reduz o barulho do bico. 90% costuma ser seguro para quem não imprime acima de 250°C.

source: Enable Host & MCU Temperature Monitoring What it does: Activates temperature sensors for: - Host CPU (your printer's main processor) - MCU drivers (stepper motor controllers) Why use it? If you use the Fluidd interface, this lets you monitor temperatures in real time — helping you spot overheating issues early. Note: If these sensors are already enabled, this option won't change your existing settings.
de_de: Host- & MCU-Temperaturüberwachung Zeigt die Temperaturen von CPU und Mainboard-Chip in Fluidd an.
es: Activar Monitoreo de Temperatura Host y MCU Qué hace: Activa los sensores de temperatura para: - CPU del Host (el procesador principal) - Drivers de la MCU (controladores de motores) ¿Por qué usarlo? Permite ver las temperaturas en tiempo real en Fluidd, ayudando a detectar problemas de calor a tiempo. Nota: Si ya están activos, esta opción no cambiará nada.
fr: Surveillance des températures Host & MCU Affiche les températures du processeur et de la carte mère sous Fluidd.
it: Monitoraggio temperature Host e MCU Mostra in Fluidd la temperatura del processore (Host) e dei driver (MCU).
pt_br: Monitoramento de Temp. do Host e MCU Exibe no Fluidd a temperatura do processador e dos drivers da impressora.

source: Nozzle Wipe Settings What it does: Controls how the nozzle is cleaned between prints. Artillery offers two versions of this macro: - Legacy version: Multiple slow wipes — can wear out the wipe pad faster. - New version: Fewer, faster wipes — reduces pad wear but cleans efficiently. Note: Changing this setting only affects prints if your slicer is configured to use the nozzle wipe feature. If your slicer doesn't trigger it, you won't see a difference.
de_de: Düsereinigung-Einstellungen (Wipe) Wahl zwischen langsamer (Legacy) und schneller (New) Reinigung am Abstreifpad.
es: Ajustes de Limpieza de Boquilla (Wipe) Qué hace: Controla cómo se limpia la boquilla entre impresiones. - Versión Legacy: Varias pasadas lentas; desgasta más la almohadilla. - Versión Nueva: Menos pasadas y más rápidas; más eficiente y menos desgaste. Nota: Solo afecta si su laminador está configurado para usar la función de limpieza de boquilla.
fr: Réglages du nettoyage de buse (Wipe) Choix entre la version lente (Legacy) et la version rapide (New) pour le nettoyage sur la brosse/tampon.
it: Impostazioni pulizia ugello (Wipe) Scegli tra la versione lenta (Legacy) o veloce (New) per la macro di pulizia sulla spazzola.
pt_br: Configurações de Limpeza do Bico (Wipe) Escolha entre a versão lenta (Legacy) ou rápida (New) para a limpeza no pad.

source: Purge Line Settings What it does: Controls how the purge line is printed before your model starts. Artillery offers two versions, plus an improved option: - Legacy version: Prints stacked lines — can stick too well to the bed. - New version: Prints a single, easy-to-remove line. - "Grumat" version: Adjusts for retraction to prevent under-extrusion at the start of your print. Note: This setting only applies if your slicer is configured to use a purge line. If your slicer doesn't trigger it, you won't see any changes.
de_de: Purge-Line-Einstellungen Die „Grumat“-Version optimiert den Druckstart, um Lücken nach der Reinigungslinie zu vermeiden.
es: Ajustes de Línea de Purga Qué hace: Controla la línea que se imprime antes de empezar el modelo. - Versión Legacy: Líneas apiladas; pueden pegarse demasiado a la cama. - Versión Nueva: Una sola línea fácil de quitar. - Versión "Grumat": Ajusta la retracción para evitar la sub-extrusión al inicio. Nota: Solo aplica si su laminador está configurado para usar línea de purga.
fr: Réglages de la ligne de purge Ce que cela fait : Contrôle la façon dont la ligne de purge est imprimée avant le début de votre modèle. Artillery propose deux versions, plus une option améliorée : - Version Legacy : Imprime des lignes superposées — peut trop adhérer au plateau. - Nouvelle version : Imprime une ligne unique, facile à retirer. - Version "Grumat" : Ajuste la rétraction pour éviter la sous-extrusion au tout début de votre impression. Note : Ce réglage ne s'applique que si votre slicer est configuré pour utiliser une ligne de purge.
it: Impostazioni linea di purga Cosa fa: controlla come viene stampata la linea di purga prima dell'inizio del modello. Artillery offre due versioni, oltre a un'opzione migliorata: - Versione Legacy: stampa linee sovrapposte (può aderire troppo al piatto). - Nuova versione: stampa una linea singola, facile da rimuovere. - Versione "Grumat": corregge la ritrazione per prevenire la sotto-estrusione all'inizio della stampa. Nota: questa impostazione si applica solo se lo slicer è configurato per usare una linea di purga.
pt_br: Configurações da Linha de Purga A versão "Grumat" evita falhas no início da impressão real após a purga.

source: Enable Filament Change (M600 Support) What it does: Adds support for the M600 filament change feature, including: - Beeper configuration (for audio alerts) - M300 macro (Play Tone) - M600 macro (Filament Change) - T600 macro (Artillery's custom "Resume Print" command) Why use it? Lets you pause prints, swap filament, and resume seamlessly — ideal for multi-color or multi-material prints. Note: The "Grumat" version includes the same functionality but follows best practices for cleaner, more maintainable code.
de_de: Filamentwechsel aktivieren (M600) Fügt Makros für Pausen zum Rollenwechsel während des Drucks hinzu.
es: Activar Cambio de Filamento (Soporte M600) Qué hace: Añade soporte para cambio de filamento M600, incluyendo: - Configuración del zumbador (alertas sonoras) - Macro M300 (Reproducir tono) - Macro M600 (Cambio de filamento) - Macro T600 (Comando "Reanudar" personalizado de Artillery) ¿Por qué usarlo? Permite pausar, cambiar de color y reanudar sin problemas. Nota: La versión "Grumat" ofrece lo mismo pero con un código más limpio y profesional.
fr: Activer le changement de filament (Support M600) Ajoute les macros nécessaires pour mettre en pause et changer de bobine en cours d'impression.
it: Abilita cambio filamento (Supporto M600) Cosa fa: aggiunge il supporto per la funzione di cambio filamento M600, inclusi: - Configurazione segnale acustico (beeper) - Macro M300 (riproduci tono) - Macro M600 (cambio filamento) - Macro T600 (comando personalizzato Artillery "Riprendi stampa") Perché usarlo? Consente di mettere in pausa, cambiare filamento e riprendere senza problemi: ideale per stampe multicolore o multimateriale. Nota: la versione "Grumat" include le stesse funzionalità ma segue standard di programmazione più puliti e mantenibili.
pt_br: Ativar Troca de Filamento (M600) Adiciona suporte para pausar e trocar a cor do filamento durante a impressão.

source: Pause Macro Settings What it does: Controls how your printer behaves when a print job is paused — whether manually or due to an issue (e.g., filament change or power loss). Available Options: - Do Not Change: Keeps your current pause macro. - Legacy: Uses Artillery's original pause macro. - New: Uses Artillery's updated pause macro, with support for M600 filament change parameters. - Grumat (Custom): Based on Artillery's new macro, but adds filament sensor support. If filament runs out, it: - Homes the print head. - Moves the printed object away to avoid purging filament over it. Recommendation: Choose "Grumat" for the most reliable pause behavior, especially if you use a filament sensor or frequently change filament mid-print.
de_de: Pause-Makro-Einstellungen Die „Grumat“-Option wird empfohlen, da sie den Kopf bei leerem Filament sicher wegfährt, um das Bauteil nicht zu beschädigen.
es: Ajustes de Macro de Pausa Qué hace: Controla el comportamiento al pausar (manual, falta de filamento o corte de luz). Opciones disponibles: - No cambiar: Mantiene su macro de pausa actual. - Legacy: Macro original de Artillery. - Nueva: Macro actualizada con soporte para parámetros M600. - Grumat (Personalizada): Basada en la nueva, pero añade soporte para el sensor de filamento. Si se acaba el filamento: - Realiza un 'Home' del cabezal de impresión. - Aleja el objeto impreso para evitar que el filamento purgado caiga encima. Recomendación: Use "Grumat" para mayor fiabilidad, especialmente si usa sensor de filamento o cambia de color a mitad de impresión.
fr: Réglages de la Macro de Pause Ce que cela fait : Contrôle le comportement de l'imprimante lors d'une mise en pause — manuelle ou suite à un problème (ex. fin de filament). Options disponibles : - Ne pas modifier : Conserve votre macro de pause actuelle. - Legacy : Utilise la macro de pause originale d'Artillery. - New : Utilise la macro mise à jour d'Artillery, supportant les paramètres M600. - Grumat (Personnalisée) : Basée sur la nouvelle macro, elle ajoute le support du sens de filament. Si le filament vient à manquer : - Elle effectue un 'Homing' de la tête d'impression. - Elle éloigne la tête de l'objet pour éviter que du filament ne coule dessus. Recommandation : Choisissez "Grumat" pour le comportement le plus fiable, surtout si vous utilisez un capteur de fin de filament.
it: Impostazioni Macro di Pausa Cosa fa: controlla il comportamento della stampante quando un lavoro viene messo in pausa, manualmente o per un problema (es. fine filamento). Opzioni disponibili: - Non modificare: mantiene la macro attuale. - Legacy: usa la macro di pausa originale di Artillery. - New: usa la macro aggiornata di Artillery, con supporto per i parametri M600. - Grumat (Personalizzata): basata sulla nuova macro Artillery, aggiunge il supporto al sensore filamento. Se il filamento finisce: - Esegue l'homing della testina. - Allontana la testina dal pezzo per evitare colature di materiale sull'oggetto. Consiglio: scegli "Grumat" per un comportamento più affidabile, specie se usi il sensore filamento.
pt_br: Configurações da Macro de Pausa A opção "Grumat" é recomendada pois afasta o bico da peça em caso de fim de filamento, evitando estragar o modelo.

source: GBi
de_de: GiB
es: GiB
fr: Gio
it: GiB
pt_br: GiB

source: MBi
de_de: MiB
es: MiB
fr: Mio
it: MiB
pt_br: MiB

source: KBi
de_de: KiB
es: KiB
fr: Kio
it: KiB
pt_br: KiB

source: Connection is invalid to complete the command!
de_de: Verbindung ungültig, Befehl abgebrochen!
es: ¡La conexión no es válida para completar el comando!
fr: Connexion invalide pour exécuter la commande !
it: Connessione non valida per completare il comando!
pt_br: Conexão inválida para completar o comando!

source: No response seen during the specified timeout!
de_de: Keine Antwort innerhalb des Zeitlimits erhalten!
es: ¡No hubo respuesta durante el tiempo de espera especificado!
fr: Aucune réponse reçue dans le délai imparti !
it: Nessuna risposta ricevuta entro il timeout!
pt_br: Sem resposta dentro do tempo limite (timeout)!

source: ERROR!
de_de: FEHLER!
fr: ERREUR !
it: ERRORE!
pt_br: ERRO!

source: Begin Step:
de_de: Starte Schritt:
es: Iniciar paso:
fr: Début de l'étape :
it: Inizio fase:
pt_br: Iniciando Passo:

source: Printer configuration has been reset, printer needs recalibration.
de_de: Konfiguration zurückgesetzt, Drucker muss neu kalibriert werden.
es: Se ha restablecido la configuración; la impresora requiere calibración.
fr: Configuration réinitialisée, l'imprimante doit être recalibrée.
it: Configurazione ripristinata. La stampante richiede calibrazione.
pt_br: Configuração redefinida. A impressora precisa ser recalibrada.

source: disabled
de_de: deaktiviert
es: deshabilitado
fr: désactivé
it: disabilitato
pt_br: desativado

source: running
de_de: läuft
es: corriendo
fr: en cours
it: in corso
pt_br: executando

source: success
de_de: erfolgreich
es: éxito
fr: succès
it: riuscito
pt_br: sucesso

source: error
de_de: fehler
fr: erreur
it: errore
pt_br: erro

source: cancelled
de_de: abgebrochen
es: cancelado
fr: annulée
it: annullato
pt_br: cancelado

source: ready
de_de: bereit
es: listo
fr: prêt
it: pronto
pt_br: pronto

source: Cancel
de_de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
pt_br: Cancelar

source: Cancelling...
de_de: Wird abgebrochen...
es: Cancelando...
fr: Annulation...
it: Annullamento...
pt_br: Cancelando...

source: Close
de_de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
pt_br: Fechar

source: Process completed successfully.
de_de: Vorgang erfolgreich abgeschlossen.
es: Proceso completado con éxito.
fr: Processus terminé avec succès.
it: Processo completato con successo.
pt_br: Processo concluído com sucesso.

source: Cannot find the copy of the configuration file!
de_de: Kopie der Konfigurationsdatei nicht gefunden!
es: ¡No se encuentra la copia del archivo de configuración!
fr: Impossible de trouver la copie du fichier de configuration !
it: Copia del file di configurazione non trovata!
pt_br: Cópia do arquivo de configuração não encontrada!

source: Configuration file editor is missing!
de_de: Editor für Konfigurationsdatei fehlt!
es: ¡Falta el editor del archivo de configuración!
fr: Éditeur de fichier de configuration manquant !
it: Editor del file di configurazione mancante!
pt_br: Editor de arquivo de configuração ausente!

source: An updated config file was found.
de_de: Aktualisierte Konfigurationsdatei gefunden.
es: Se encontró un archivo de configuración actualizado.
fr: Un fichier de config mis à jour a été trouvé.
it: Trovato un file di configurazione aggiornato.
pt_br: Um arquivo de configuração atualizado foi encontrado.

source: A legacy config file was found.
de_de: Alte Konfigurationsdatei gefunden.
es: Se encontró un archivo de configuración antiguo (legacy).
fr: Un fichier de config 'Legacy' a été trouvé.
it: Trovato un file di configurazione legacy.
pt_br: Um arquivo de configuração antigo (legacy) foi encontrado.

source: The section {0} was removed.
de_de: Sektion {0} wurde entfernt.
es: Se eliminó la sección {0}.
fr: La section {0} a été supprimée.
it: La sezione {0} è stata rimossa.
pt_br: A seção {0} foi removida.

source: The section {0} was added.
de_de: Sektion {0} wurde hinzugefügt.
es: Se añadió la sección {0}.
fr: La section {0} a été ajoutée.
it: La sezione {0} è stata aggiunta.
pt_br: A seção {0} foi adicionada.

source: The section {0} was replaced.
de_de: Sektion {0} wurde ersetzt.
es: Se reemplazó la sección {0}.
fr: La section {0} a été remplacée.
it: La sezione {0} è stata sostituita.
pt_br: A seção {0} foi substituída.

source: The value {0}/{1} was added/updated to {2}.
de_de: Wert {0}/{1} wurde auf {2} gesetzt/aktualisiert.
es: El valor {0}/{1} se añadió/actualizó a {2}.
fr: La valeur {0}/{1} a été ajoutée/mise à jour à {2}.
it: Il valore {0}/{1} è stato aggiunto/aggiornato a {2}.
pt_br: O valor {0}/{1} foi adicionado/atualizado para {2}.

source: The value {0}/{1} was added/updated.
de_de: Wert {0}/{1} wurde hinzugefügt/aktualisiert.
es: El valor {0}/{1} se añadió/actualizó.
fr: La valeur {0}/{1} a été ajoutée/mise à jour.
it: Il valore {0}/{1} è stato aggiunto/aggiornato.
pt_br: O valor {0}/{1} foi adicionado/atualizado.

source: The value {0}/{1} was removed.
de_de: Wert {0}/{1} wurde entfernt.
es: El valor {0}/{1} fue eliminado.
fr: La valeur {0}/{1} a été supprimée.
it: Il valore {0}/{1} è stato rimosso.
pt_br: O valor {0}/{1} foi removido.

source: The persistence block was reset.
de_de: Persistenz-Block wurde zurückgesetzt.
es: Se restableció el bloque de persistencia.
fr: Le bloc de persistance a été réinitialisé.
it: Il blocco di persistenza è stato resettato.
pt_br: O bloco de persistência foi redefinido.

source: Backup Current Configuration
de_de: Aktuelle Konfiguration sichern
es: Respaldar Configuración Actual
fr: Sauvegarder la config actuelle
it: Backup configurazione attuale
pt_br: Backup da Configuração Atual

source: Successfully copy file '{}'
de_de: Datei '{}' erfolgreich kopiert
es: Archivo '{}' copiado con éxito
fr: Fichier '{}' copié avec succès
it: Copia del file '{}' riuscita
pt_br: Arquivo '{}' copiado com sucesso

source: Created a backup in '{}'
de_de: Backup erstellt unter '{}'
es: Respaldo creado en '{}'
fr: Sauvegarde créée dans '{}'
it: Creato backup in '{}'
pt_br: Backup criado em '{}'

source: Reset Printer Configuration
de_de: Konfiguration zurücksetzen
es: Restablecer Configuración de Impresora
fr: Réinitialiser la configuration
it: Reset configurazione stampante
pt_br: Redefinir Configuração

source: Validate Printer Configuration
de_de: Konfiguration validieren
es: Validar Configuración de Impresora
fr: Valider la configuration
it: Valida configurazione stampante
pt_br: Validar Configuração

source: Configuration file is incomplete. Please reset printer configuration to factory default!
es: El archivo de configuración está incompleto. ¡Por favor, restablece la configuración de la impresora a los valores de fábrica!
fr: Le fichier de configuration est incomplet. Veuillez réinitialiser la configuration de l’imprimante aux paramètres d’usine !
it: Il file di configurazione è incompleto. Per favore, ripristina la configurazione della stampante ai valori di fabbrica!

source: Fix Printer Model Settings
de_de: Modell-Einstellungen fixen
es: Corregir Ajustes de Modelo
fr: Réparer les paramètres du modèle
it: Correggi parametri modello
pt_br: Corrigir Ajustes do Modelo

source: Enable Exclude Object
de_de: „Exclude Object“ aktivieren
es: Activar Excluir Objeto
fr: Activer Exclude Object
it: Abilita Exclude Object
pt_br: Ativar Exclude Object

source: Z-Axis Stepper Motor Hold Current
de_de: Z-Motor-Haltestrom
es: Corriente de Retención Motor Z
fr: Courant de maintien moteurs Z
it: Corrente mantenimento motori Z
pt_br: Corrente Motor Z

source: Extruder Acceleration Limit
de_de: Extruder Beschleunigungslimit
es: Límite Aceleración Extrusor
fr: Limite d'accélération extrudeur
it: Limite accelerazione estrusore
pt_br: Limite Aceleração Extrusora

source: Extruder Motor Current Settings
de_de: Extruder Motorstrom
es: Ajustes Corriente Extrusor
fr: Réglage courant extrudeur
it: Corrente motore estrusore
pt_br: Corrente Motor Extrusora

source: Distance Sensor Offset
de_de: Abstandssensor-Offset
es: Offset Sensor de Distancia
fr: Offset du capteur de distance
it: Offset sensore distanza
pt_br: Offset do Sensor

source: Z-Offset Sampling
de_de: Z-Offset-Abtastung
es: Muestreo de Z-Offset
fr: Échantillonnage Z-Offset
it: Campionamento Z-Offset
pt_br: Amostragem Z-Offset

source: Z-Offset Error Margin
de_de: Z-Offset Fehlertoleranz
es: Margen de Error Z-Offset
fr: Marge d'erreur Z-Offset
it: Margine errore Z-Offset
pt_br: Margem de Erro Z-Offset

source: Enable Manual Bed Leveling
de_de: Manuelles Leveln aktivieren
es: Activar Nivelación Manual
fr: Activer nivellement manuel
it: Abilita livellamento manuale
pt_br: Ativar Nivelamento Manual

source: Rename Fans for Clarity
de_de: Lüfter umbenennen
es: Renombrar Ventiladores
fr: Renommer les ventilateurs
it: Rinomina ventole
pt_br: Renomear Ventoinhas

source: Enhanced Mainboard Fan Control
de_de: Mainboard-Lüftersteuerung
es: Control Mejorado Ventilador Placa
fr: Contrôle amélioré ventilo CM
it: Controllo migliorato ventola MB
pt_br: Controle Ventoinha Placa

source: Adjust Mainboard Fan Speed
de_de: Mainboard-Lüfterdrehzahl
es: Ajustar Velocidad Vent. Placa
fr: Vitesse ventilateur CM
it: Velocità ventola MB
pt_br: Velocidade Ventoinha Placa
