Repository: grumat/artillery-x4-pro_config
Catalog: unbrick-swx4/locale/*/LC_MESSAGES/messages.po
Languages: de_de, es, fr, it, pt_br

source: Z-Axis Stepper Motor Hold Current What it does: This setting determines how much power the Z-axis motors use to hold their position when the printer is idle. Available options: - 800mA (recommended for most users) - 900mA (only if you notice the Z-axis slipping or losing position) Factory defaults: - X4-Plus: 800mA - X4-Pro: 900mA Note: The X4-Plus has more weight to hold, so the factory default of 800mA might seem low compared to the X4-Pro. However, 800mA is usually sufficient unless you experience issues.
de_de: Haltestrom der Z-Achsen-Motoren Bestimmt die Kraft, mit der die Z-Motoren ihre Position im Stillstand halten. Werksvorgaben: - X4-Plus: 800mA - X4-Pro: 900mA Empfehlung: 800mA ist meist ausreichend.
es: Corriente de Retención del Motor Z Qué hace: Determina cuánta energía usan los motores del eje Z para mantener su posición cuando la impresora está inactiva. Opciones disponibles: - 800mA (recomendado para la mayoría) - 900mA (solo si nota que el eje Z se desliza o pierde posición) Valores de fábrica: - X4-Plus: 800mA - X4-Pro: 900mA Nota: La X4-Plus tiene más peso que sostener, por lo que 800mA podría parecer poco comparado con la Pro. Sin embargo, suele ser suficiente.
fr: Courant de maintien du moteur pas pas à pas sur l’axe Z Ce qu’il fait : Ce réglage détermine la puissance utilisée par les moteurs de l’axe Z pour maintenir leur position lorsque l’imprimante est au repos. Options disponibles : - 800 mA (recommandé pour la plupart des utilisateurs) - 900 mA (seulement si vous remarquez que l’axe Z glisse ou perd sa position) Paramètres d’usine : - X4-Plus : 800 mA - X4-Pro : 900 mA Note : Le X4-Plus a plus de poids à supporter, donc le défaut d’usine de 800 mA peut sembler faible comparé au X4-Pro. Cependant, 800 mA suffisent généralement sauf si vous rencontrez des problèmes.
it: Corrente di mantenimento motori Z Determina quanta energia usano i motori dell'asse Z per mantenere la posizione quando fermi. Valori di fabbrica: - X4-Plus: 800mA - X4-Pro: 900mA Nota: 800mA è solitamente sufficiente anche per la Plus.
pt_br: Corrente de Manutenção do Motor de Passo do Eixo Z O que ele faz: Essa configuração determina quanta potência os motores do eixo Z usam para manter a posição quando a impressora está ociosa. Opções disponíveis: - 800mA (recomendado para a maioria dos usuários) - 900mA (somente se você notar o deslizamento ou perda de posição do eixo Z) Configurações de fábrica: - X4-Plus: 800mA - X4-Pro: 900mA Nota: O X4-Plus tem mais peso para suportar, então o padrão de fábrica de 800mA pode parecer baixo comparado ao X4-Pro. No entanto, 800mA geralmente é suficiente, a menos que você tenha problemas.

source: Extruder Acceleration Limit Why it matters: This setting controls how quickly the extruder motor speeds up or slows down. Older firmware versions used higher acceleration, but newer versions have reduced it. What you need to know: - Higher acceleration can cause the extruder motor to heat up more. - Too much heat may soften the filament inside the extruder, increasing the risk of clogs. Recommendation: Unless you're experiencing issues, stick with the default or lower acceleration setting to keep temperatures stable.
de_de: Extruder-Beschleunigungslimit Begrenzt die Beschleunigung des Extrudermotors. Hohe Werte können den Motor erhitzen und das Filament im Extruder weich machen, was zu Verstopfungen führt.
es: Límite de Aceleración del Extrusor Por qué es importante: Controla qué tan rápido acelera o frena el motor del extrusor. Las versiones antiguas usaban aceleraciones altas, pero las nuevas las han reducido. Lo que debe saber: - Una aceleración alta puede hacer que el motor del extrusor se caliente más. - El exceso de calor puede ablandar el filamento dentro del extrusor, aumentando el riesgo de atascos (clogs). Recomendación: A menos que tenga problemas, mantenga el valor predeterminado o bajo para que las temperaturas sean estables.
fr: Limite d'accélération de l'extrudeur Pourquoi est-ce important : Ce réglage contrôle la rapidité avec laquelle le moteur de l'extrudeur accélère ou ralentit. Les anciennes versions du firmware utilisaient une accélération plus élevée, mais les versions plus récentes l'ont réduite. Ce que vous devez savoir : - Une accélération plus élevée peut faire chauffer davantage le moteur de l'extrudeur. - Une chaleur excessive peut ramollir le filament à l'intérieur de l'extrudeur, augmentant ainsi le risque d'obstruction (clog). Recommandation : À moins que vous ne rencontriez des problèmes, tenez-vous-en au réglage par défaut ou à une accélération plus faible pour maintenir des températures stables.
it: Limite accelerazione estrusore Perché è importante: questa impostazione controlla la rapidità con cui il motore dell'estrusore accelera o rallenta. Le versioni precedenti del firmware usavano un'accelerazione maggiore, ridotta poi nelle versioni più recenti. Cosa c'è da sapere: - Un'accelerazione elevata può causare il surriscaldamento del motore. - Il calore eccessivo può ammorbidire il filamento all'interno dell'estrusore, aumentando il rischio di intasamenti (clog). Consiglio: a meno che non si riscontrino problemi, è preferibile mantenere l'impostazione predefinita o un'accelerazione inferiore.
pt_br: Limite de Aceleração da Extrusora Controla a rapidez com que o motor da extrusora acelera. Valores muito altos podem superaquecer o motor e amolecer o filamento precocemente, causando entupimentos (clogs).

source: Extruder Motor Current Settings The Sidewinder X4-Plus and X4-Pro use the same extruder, but their factory settings for motor current differ. This inconsistency might be an oversight. Here's what you need to know: - X4-Plus: 800mA (factory setting) - Common recommendation: 900mA - X4-Pro: 1000mA (factory setting) What does this mean for you? Higher current (e.g., 1000mA): The extruder motor runs hotter, which may increase the risk of clogs. Can improve filament flow for faster prints. Lower current (e.g., 800mA): Motor stays cooler, reducing clog risk. May limit maximum print speed. Recommendation: If you're unsure, start with 900mA — a balanced setting for most users. Adjust based on your printing needs and monitor for overheating or clogs.
de_de: Extruder-Motorstrom X4 Plus und Pro nutzen den gleichen Extruder mit unterschiedlichen Werkseinstellungen. - Höherer Strom (1000mA): Mehr Kraft, aber Motor wird heißer (Clog-Gefahr). - Niedrigerer Strom (800mA): Kühlerer Motor, evtl. Limit bei High-Speed. Empfehlung: 900mA bietet meist die beste Balance.
es: Ajustes de Corriente del Motor del Extrusor La X4-Plus y la X4-Pro usan el mismo extrusor, pero sus ajustes de fábrica son diferentes. Esto podría ser un descuido. Esto es lo que debe saber: - X4-Plus: 800mA (ajuste de fábrica) - Recomendación común: 900mA - X4-Pro: 1000mA (ajuste de fábrica) ¿Qué significa esto para usted? Corriente mayor (ej. 1000mA): El motor calienta más, lo que puede aumentar atascos, pero mejora el flujo para impresiones rápidas. Corriente menor (ej. 800mA): El motor está más frío, reduciendo atascos, pero puede limitar la velocidad máxima. Recomendación: Si tiene dudas, use 900mA, un valor equilibrado. Ajuste según sus necesidades y vigile el calor o los atascos.
fr: Réglage du courant du moteur de l'extrudeur La Sidewinder X4-Plus et la X4-Pro utilisent le même extrudeur, mais leurs réglages d'usine pour le courant moteur diffèrent. Voici ce qu'il faut savoir : - X4-Plus : 800mA (réglage d'usine) - Recommandation courante : 900mA - X4-Pro : 1000mA (réglage d'usine) Qu'est-ce que cela signifie pour vous ? Courant plus élevé (ex. 1000mA) : Le moteur chauffe plus, ce qui peut augmenter le risque de bouchage. Cela peut améliorer le débit pour les impressions rapides. Courant plus faible (ex. 800mA) : Le moteur reste plus froid, réduisant le risque de bouchage, mais peut limiter la vitesse d'impression maximale. Recommandation : En cas de doute, commencez par 900mA — un équilibre idéal pour la plupart des utilisateurs.
it: Corrente motore estrusore La Plus e la Pro usano lo stesso estrusore ma con correnti diverse. - Più corrente (1000mA): più spinta ma più calore (rischio clog). - Meno corrente (800mA): motore più freddo ma velocità ridotta. Consiglio: 900mA è l'equilibrio ideale per la maggior parte degli utenti.
pt_br: Corrente do Motor da Extrusora A Plus e a Pro usam a mesma extrusora, mas com correntes diferentes de fábrica. - Corrente Alta (1000mA): Mais força, mas motor mais quente (risco de entupimento). - Corrente Baixa (800mA): Motor mais frio, mas pode limitar velocidades extremas. Recomendação: 900mA é o ponto ideal para a maioria.

source: Input Pin Polarity What it does: Adjusts the probe's input pin logic level. Important Note: This feature is only intended to use if you replaced your inductive sensor to the professional grade "Panasonic GX-H12A". Need help? My repository includes: - Test procedures - Step-by-step guides - Links to the official data sheet
es: Polaridad del pin de entrada Qué hace: Ajusta el nivel lógico del pin de entrada de la sonda. Polaridad del pin de entrada Nota importante: Esta función solo está diseñada para usarse si ha reemplazado el sensor inductivo por el de grado profesional \"Panasonic GX-H12A\". ¿Necesita ayuda? Mi repositorio incluye: - Procedimientos de prueba - Guías paso a paso - Enlaces a la ficha técnica oficial
fr: Polarité de la broche d'entrée Ce que cela fait : Ajuste le niveau logique de la broche d'entrée de la sonde. Note importante : Cette fonction est uniquement destinée à être utilisée si vous avez remplacé votre capteur inductif par le modèle professionnel « Panasonic GX-H12A ». Besoin d'aide ? Mon dépôt comprend : - Procédures de test - Guides étape par étape - Liens vers la fiche technique officielle
it: Polarità del pin di ingresso Cosa fa: Regola il livello logico del pin di ingresso della sonda. Nota importante: Questa funzione è destinata all'uso solo se è stato sostituito il sensore induttivo con quello di grado professionale \"Panasonic GX-H12A\". Serve aiuto? Il mio repository include: - Procedure di test - Guide passo-passo - Link alla scheda tecnica ufficiale

source: Distance Sensor Offset What it does: Adjusts the probe offset to correct inconsistencies in the factory settings. Important Note: Artillery mounts the sensor backwards compared to the manufacturer's recommendations. For best results, we recommend modifying the sensor's orientation to match the official data sheet. If you've already done this mod: Select the "180° Mount" option. Need help? My repository includes: - Test procedures - Step-by-step guides - Links to the official data sheet
de_de: Entfernungssensor-Offset Was es macht: Passt den Sondenoffset an, um Inkonsistenzen in den Werkseinstellungen zu korrigieren. Wichtiger Hinweis: Die Artillerie montiert den Sensor rückwärts im Vergleich zu den Herstellerempfehlungen. Für beste Ergebnisse empfehlen wir, die Ausrichtung des Sensors so anzupassen, dass sie mit dem offiziellen Datenblatt übereinstimmt. Wenn du diesen Mod schon gemacht hast: Wähle die Option "180° Mount". Brauchst du Hilfe? Mein Repository enthält: - Testverfahren - Schritt-für-Schritt-Anleitungen - Links zum offiziellen Datenblatt
es: Offset del Sensor de Distancia Qué hace: Ajusta el desfase (offset) de la sonda para corregir inconsistencias en los ajustes de fábrica. Nota importante: Artillery monta el sensor al revés según las recomendaciones del fabricante. Para mejores resultados, recomendamos modificar la orientación del sensor según la ficha técnica oficial. Si ya hizo este mod: Seleccione la opción "Montaje 180°". ¿Necesita ayuda? Mi repositorio incluye: - Procedimientos de prueba - Guías paso a paso - Enlaces a la ficha técnica oficial
fr: Décalage du capteur de distance Ce que ça fait : ajuste le décalage de la sonde pour corriger les incohérences dans les paramètres d’usine. Note importante : l’artillerie monte le capteur à l’envers par rapport aux recommandations du fabricant. Pour de meilleurs résultats, nous recommandons de modifier l’orientation du capteur pour correspondre à la fiche technique officielle. Si vous avez déjà fait ce mod : sélectionnez l’option « Montage à 180° ». Besoin d’aide ? Mon dépôt comprend : - Procédures de test - Guides étape par étape - Liens vers la fiche technique officielle
it: Offset del sensore di distanza Cosa fa: regola l'offset della sonda per correggere le incongruenze nelle impostazioni di fabbrica. Nota importante: Artillery monta il sensore al contrario rispetto alle raccomandazioni del produttore. Per ottenere i migliori risultati, consigliamo di modificare l'orientamento del sensore per adattarlo alla scheda tecnica ufficiale. Se hai già effettuato questa modifica: seleziona l'opzione "Montaggio 180°". Hai bisogno di aiuto? Il repository include: - Procedure di test - Guide passo-passo - Link alla scheda tecnica ufficiale
pt_br: Deslocamento do sensor de distância O que ele faz: ajusta o deslocamento da sonda para corrigir inconsistências nas configurações de fábrica. Nota importante: A artilharia monta o sensor ao contrário em relação às recomendações do fabricante. Para melhores resultados, recomendamos modificar a orientação do sensor para corresponder à ficha oficial de dados. Se você já fez esse mod: Selecione a opção "180° Mount". Precisa de ajuda? Meu repositório inclui: - Procedimentos de teste - Guias passo a passo - Links para a ficha técnica oficial

source: Improve Z-Offset Sampling What it does: Enhances the accuracy of your Z-offset by using: - Slower sampling speeds - More samples for better precision Why use it? A more accurate Z-offset reduces errors and helps ensure a consistent first layer for your prints — regardless of your distance sensor's orientation.
de_de: Z-Offset-Abtastung verbessern Erhöht die Präzision des Z-Offsets durch langsamere Messgeschwindigkeit und mehr Messpunkte.
es: Mejorar Muestreo del Z-Offset Qué hace: Mejora la precisión de su Z-offset mediante: - Velocidades de muestreo más lentas - Más muestras para una mejor precisión ¿Por qué usarlo? Un Z-offset más preciso reduce errores y asegura una primera capa consistente, independientemente de la orientación del sensor.
fr: Améliorer l'échantillonnage du Z-Offset Utilise une vitesse de palpage plus lente et plus de points pour une meilleure précision de la première couche.
it: Migliora campionamento Z-Offset Aumenta la precisione dello Z-offset usando velocità di sondaggio ridotte e un numero maggiore di campioni.
pt_br: Melhorar Amostragem do Z-Offset Aumenta a precisão do Z-offset usando velocidades de sondagem menores e mais coletas de dados.

source: Improve Z-Offset Validation What it does: Makes Z-offset calibration stricter by reducing the allowed error margin for sampled data. This ensures only the most precise measurements are accepted. Result: More reliable Z-offset and bed mesh calibration, leading to better first layers. Important: If your printer hasn't been modified, enabling this option may cause calibration errors or failures. Use only if your printer is properly tuned.
de_de: Z-Offset-Validierung verschärfen Reduziert die Toleranz bei Messabweichungen. Nur bei mechanisch gut eingestelltem Drucker nutzen, da sonst Kalibrierungsfehler auftreten können.
es: Mejorar Validación del Z-Offset Qué hace: Hace que la calibración del Z-offset sea más estricta al reducir el margen de error permitido. Asegura que solo se acepten las mediciones más precisas. Resultado: Calibraciones de Z-offset y malla de cama más fiables. Importante: Si su impresora no está modificada, esta opción podría causar errores de calibración. Úsela solo si su impresora está bien ajustada.
fr: Améliorer la validation du Z-Offset Rend le contrôle du palpage plus strict. À n'utiliser que si votre imprimante est bien réglée mécaniquement, sinon cela peut générer des erreurs.
it: Migliora validazione Z-Offset Rende il controllo dei campioni più severo. Da usare solo se la stampante è ben regolata meccanicamente per evitare errori di calibrazione.
pt_br: Melhorar Validação do Z-Offset Torna o critério de aceitação de medidas mais rigoroso. Use apenas se a impressora estiver mecanicamente bem ajustada.

source: Enable Manual Bed Leveling What it does: Activates Klipper's manual bed leveling tool, which helps you adjust your print bed screws for a perfectly level surface. How it works: - A "BED_SCREWS_ADJUST" button will appear in the Fluidd interface. - Follow the on-screen instructions or check online guides for step-by-step help. Note: If you disable this option later, any existing screw adjustment settings in your configuration will remain unchanged.
de_de: Manuelles Leveln aktivieren Aktiviert den Klipper-Assistenten für die Bettschrauben. Ein Button „BED_SCREWS_ADJUST“ erscheint in Fluidd.
es: Activar Nivelación Manual de Cama Qué hace: Activa la herramienta de nivelación manual de Klipper para ajustar los tornillos de la cama y dejarla perfectamente nivelada. Cómo funciona: - Aparecerá un botón "BED_SCREWS_ADJUST" en la interfaz Fluidd. - Siga las instrucciones en pantalla o guías en línea. Nota: Si desactiva esta opción después, los ajustes de tornillos ya existentes en su configuración no cambiarán.
fr: Activer le nivellement manuel du plateau Active l'assistant Klipper pour ajuster les vis du plateau. Un bouton "BED_SCREWS_ADJUST" apparaîtra sous Fluidd.
it: Abilita livellamento manuale Attiva l'assistente per regolare le viti del piatto. Apparirà un pulsante "BED_SCREWS_ADJUST" nell'interfaccia Fluidd.
pt_br: Ativar Nivelamento Manual Ativa o assistente de parafusos da mesa. Um botão "BED_SCREWS_ADJUST" aparecerá no Fluidd para ajudar no nivelamento.

source: Rename Fans for Clarity What it does: Renames your printer's fans in the Fluidd interface for easier identification: - "Fan 0" → "Heat Break Cooling Fan" - "Fan 2" → "Mainboard Fan" Why use it? Makes it simpler to control and monitor the right fan at a glance.
de_de: Lüfter zur Klarheit umbenennen Ändert „Fan 0“ und „Fan 2“ in aussagekräftige Namen in der Fluidd-Oberfläche.
es: Renombrar Ventiladores para Claridad Qué hace: Renombra los ventiladores en Fluidd para identificarlos mejor: - "Fan 0" → "Ventilador del Heat Break" - "Fan 2" → "Ventilador de Placa Base" ¿Por qué usarlo? Facilita el control y monitoreo de cada ventilador de un vistazo.
fr: Renommer les ventilateurs pour plus de clarté Ce que ça fait : Renomme les ventilateurs de ton imprimante dans l’interface Fluidd pour faciliter l’identification : - « Fan 0 » → « Heat Break Cooling Fan » - « Fan 2 » → « Mainboard Fan » Pourquoi l’utiliser ? Cela facilite le contrôle et la surveillance du bon ventilateur d’un coup d’œil.
it: Rinomina ventole per chiarezza Cambia i nomi generici delle ventole in Fluidd con nomi descrittivi (es. Ventola Scheda Madre).
pt_br: Renomear Ventoinhas (Fans) Troca nomes genéricos como "Fan 0" por nomes claros (ex: Ventoinha da Placa Mãe).

source: Enhanced Mainboard Fan Control What's the issue? The factory setting only turns on the mainboard fan when the print nozzle is active. While this works for basic printing, it ignores the fan's real purpose: cooling the stepper motor drivers. Why is this a problem? If you move the printer a lot (e.g., homing, manual moves) without heating the nozzle, the stepper drivers can overheat, causing errors or shutdowns. What this option does: The fan will now activate whenever any of these are active: - Heat bed - Print nozzle - Stepper drivers (most critical!) Recommendation: Enable this option to prevent overheating and improve reliability. Note: If you've already customized this setting, the tool won't override your changes.
de_de: Verbesserte Mainboard-Lüftersteuerung Ab Werk läuft der Lüfter nur, wenn die Düse heizt. Diese Option schaltet den Lüfter auch bei Motoraktivität ein, um die Treiber beim Homing oder bei manuellen Bewegungen vor Überhitzung zu schützen.
es: Control Mejorado del Ventilador de Placa ¿Cuál es el problema? El ajuste de fábrica solo enciende el ventilador de la placa cuando la boquilla está caliente. Esto ignora su propósito real: enfriar los controladores (drivers) de los motores. ¿Por qué es un problema? Si mueve mucho la impresora (homing, movimientos manuales) sin calentar la boquilla, los drivers pueden sobrecalentarse y causar errores o paradas de emergencia. Qué hace esta opción: El ventilador se activará siempre que esté activo: - La cama caliente - La boquilla de impresión - Los drivers de los motores (¡lo más crítico!) Recomendación: Actívelo para evitar sobrecalentamientos y mejorar la fiabilidad general. Nota: Si ya personalizó este ajuste, la herramienta no lo sobrescribirá.
fr: Contrôle amélioré du ventilateur de carte mère D'usine, le ventilateur ne tourne que si la buse chauffe. Cette option l'active dès que les moteurs travaillent, évitant la surchauffe des drivers lors des déplacements manuels ou du homing.
it: Controllo migliorato ventola scheda madre Di fabbrica la ventola si accende solo se l'ugello scalda. Questa opzione la attiva ogni volta che i motori o il piatto sono in funzione, evitando il surriscaldamento dei driver durante l'homing o i movimenti manuali.
pt_br: Controle Otimizado da Ventoinha da Placa De fábrica, a ventoinha da placa só liga se o bico estiver aquecendo. Esta opção a liga sempre que os motores ou a mesa estiverem ativos, evitando que os drivers superaqueçam durante o homing ou movimentos manuais.
